{
    "navbar": {
        "nav1": "About me",
        "nav2": "Skills",
        "nav3": "Projects",
        "nav4": "Contact"
    },
    "intro": {
        "title": "Hello everyone, I am",
        "welcome": "Welcome to my portfolio"
    },
    "about": {
        "title": "About Me!",
        "intro1": "As a passionate software developer, I am always looking for new challenges to put my skills and knowledge into practice. I consider myself a curious and self-taught person, which allows me to keep myself updated with the latest technologies and trends in the IT and development field.",
        "intro2": "I am a proactive and collaborative team member with a strong work ethic and analytical skills to solve problems efficiently. In addition, I am always willing to learn and take on new challenges to expand my skills and experience.",
        "intro3": "I am excited to join an innovative and dynamic team, where I can apply my skills and knowledge to make a significant contribution. Whether as a Full-stack Developer or Front-end, I am confident that I can be a valuable asset to any project. I look forward to exploring exciting opportunities in this area and being part of a passionate and committed team."
    },
    "projects": {
        "title": "Projects",
        "pokeintro": "Individual academic project of Soy Henrry's bootcamp. It is a SPA (Single Page Application), in which you can see different types of pokemon, you can also filter and/or sort them. You can also create new pokemon.",
        "pokeintro2": "This application was developed by me both frontend and backend.This application was developed by me both frontend and backend..",
        "modalpoke": "It is a SPA, where an API (PokéAPI) is consumed, the project consisted in showing the Pokémons, searching them in a specific way, filtering and sorting. You can also see the details of each Pokémon by clicking on the image and you can create a Pokémon.",
        "bnb_vermas": "More",
        "modal_tecnologia": "Technologies:",
        "bnb_codigo": "Code",
        
        "weatherAppintro": "It is a SPA (Single Page Application) in which you can search the weather of different cities.",
        "weatherAppintro2": "This application was developed by me.",
        "modalweatherApp": "It is a SPA, where an API (OpenWeathermap) is consumed. You can search for the city you want to see, it will be displayed on the screen with the temperature, the country and an image of the weather, you can delete that we no longer want to see. Also in More Details option you can see more information about the city.",
       
        "heanrybankintro": "Academic group project of the Soy Henrry bootcamp. It is a virtual mobile wallet, where the user can deposit money, receive money from his account, buy and sell currencies, as well as cryptocurrencies.",
        "heanrybankintro2": "In this project I worked on the backend.",
        "modalhenrybank": "Henry Bank is a virtual wallet in mobile format (apk) developed in React Native. It was born as an integrative group project to put into practice all the knowledge acquired in the Soy Henry bootcamp. We also work using the SCRUM methodology",
        "bnb_code_front": "Code-Frontend",
        "bnb_code_back": "Code-Backend",

        "MeliCLoneIntro": "Project based on MercadoLibre's challenge, but this time we made a clone of MercadoLibre's main page and consumed its API to give it some functionalities.",
        "MeliCLone2": "",
        "modalMeliCLone":"The main functions of the application are, item search with results view and also filtering, item details showing also questions asked by users.",

        "ChallengeRappi": "Rappi Frontend Developer Challenge",
        "ChallengeRappi2": "This application was developed by me.",
        "modalChallengeRappi":"Frontend Developer Challenge of Rappi asked for some requirements for an e-commerce like, menu with sublevels, filter and sort products by price, quantity and availability, create a cart and the products stay in the cart if the user closes the page, etc. All requirements are in the github readme.",

        "ChallengeLogin": "Challenge that contains Roles like admin and user, in which we are going to be able to register and when entering we are going to see a table of clients that we can create, modify and eliminate with the role of admin. ",
        "ChallengeLogin2": "We will also be able to filter them from highest to lowest or vice versa, also search by name and age range.",
        "modalChallengeLogin": "For this challenge in the Fronted we used React, Redux for the state management and Tailwind CSS for the styles, also for the password encryption we used JWT. In the Backend part I had to generate a REST API for the Login and the CRUD, which I made the routes with Express.js and for the Database, I was learning to use MongoDB, with the ORM Mongoose. More information can be found in the Readme of the Github repository.",

        "ToDoListIntro": "Project that consists of creating your own task list.",
        "ToDoListIntro2": "This application was developed by me.",
        "modalTodoList":"App used to create your list of tasks, in which we can add them and once we have completed it, we can change its status and delete it, we can also delete a set of completed tasks or clean the entire list without having completed the tasks.",

        "GitAppIntro":"I have developed a web application using React and Tailwind CSS on the frontend, and Express.js for path creation. The application consumes the GitHub API, using the link-header package to implement the pagination provided by the API itself..",
        "GitAppIntro2":"",
        "modalGitApp":"The application allows to visualize a list of GitHub users, with the possibility to access the details of each user and their respective repositories. My focus in the development of this application has been to improve my skills in handling APIs and building web applications using React."

    }, 

    "contact" :{
        "title":"Contact"
    }
}
