{
    "navbar": {
        "nav1": "About me",
        "nav2": "Skills",
        "nav3": "Projects",
        "nav4": "Contact"
    },
    "intro": {
        "title": "Hello everyone, I am",
        "welcome": "Welcome to my portfolio"
    },
    "about": {
        "title": "About Me!",
        "intro1": "I am a curious person, I like to understand how things work and I love everything related to computers and development.",
        "intro2": "I consider myself a proactive, responsible, analytical, self-taught person, who likes to work in a team and have a good predisposition to face problems and always willing to learn in order to increase my skills.",
        "intro3": "I am looking for my first job opportunity to demonstrate my skills and I am open to all opportunities that allow me to grow and continue training."
    },
    "projects": {
        "title": "Projects",
        "pokeintro": "Individual academic project of Soy Henrry's bootcamp. It is a SPA (Single Page Application), in which you can see different types of pokemon, you can also filter and/or sort them. You can also create new pokemon.",
        "pokeintro2": "This application was developed by me both frontend and backend.This application was developed by me both frontend and backend..",
        "modalpoke": "It is a SPA, where an API (PokéAPI) is consumed, the project consisted in showing the Pokémons, searching them in a specific way, filtering and sorting. You can also see the details of each Pokémon by clicking on the image and you can create a Pokémon.",
        "bnb_vermas": "More",
        "modal_tecnologia": "Technologies:",
        "bnb_codigo": "Code",
        
        "weatherAppintro": "It is a SPA (Single Page Application) in which you can search the weather of different cities.",
        "weatherAppintro2": "This application was developed by me.",
        "modalweatherApp": "It is a SPA, where an API (OpenWeathermap) is consumed. You can search for the city you want to see, it will be displayed on the screen with the temperature, the country and an image of the weather, you can delete that we no longer want to see. Also in More Details option you can see more information about the city.",
       
        "heanrybankintro": "Academic group project of the Soy Henrry bootcamp. It is a virtual mobile wallet, where the user can deposit money, receive money from his account, buy and sell currencies, as well as cryptocurrencies.",
        "heanrybankintro2": "In this project I worked on the backend.",
        "modalhenrybank": "Henry Bank is a virtual wallet in mobile format (apk) developed in React Native. It was born as an integrative group project to put into practice all the knowledge acquired in the Soy Henry bootcamp. We also work using the SCRUM methodology",
        "bnb_code_front": "Code-Frontend",
        "bnb_code_back": "Code-Backend",

        "ToDoListIntro": "Project that consists of creating your own task list.",
        "ToDoListIntro2": "Esta aplicacion fue desarrolloda por mi.",
        "modalTodoList":"App used to create your list of tasks, in which we can add them and once we have completed it, we can change its status and delete it, we can also delete a set of completed tasks or clean the entire list without having completed the tasks.",

        "CalcIntro": "Project consisting of the creation of a calculator with basic functions..",
        "CalcIntro2": "Esta aplicacion fue desarrolloda por mi.",
        "modalCalc":"Project consisting of the creation of a calculator with basic functions."
    }, 

    "contact" :{
        "title":"Contact"
    }
}
